
import os
import sys

sys.path.append(os.path.join(os.path.dirname(__file__), "..", "src"))

from database.user import UserTable, UserData, UserDataFilter
import datetime


db = UserTable()


def add_test_data():
    test_data = [
        ["98:27:F6:B5:FD:57", "Иванов Иван Иванович", "вход", "15:00 01.10.2025"],
        ["A4:C3:F2:18:9D:44", "Петров Петр Петрович", "выход", "15:00 02.10.2025"],
        ["BC:76:5E:3A:D1:9F", "Сидорова Мария Сергеевна", "вход", "15:00 03.10.2025"],
        ["D8:92:4A:7C:E5:33", "Козлов Алексей Владимирович",
            "выход", "15:00 04.10.2025"],
        ["E1:5B:9F:62:A8:7D", "Новикова Елена Дмитриевна", "вход", "15:00 05.10.2025"],
        ["F7:3C:8D:29:B4:16", "Морозов Дмитрий Игоревич", "выход", "15:00 06.10.2025"],
        ["2A:9E:C4:5F:87:21", "Волкова Анна Петровна", "вход", "15:00 07.10.2025"],
        ["4D:B1:6E:93:2C:58", "Семенов Сергей Васильевич",
            "выход", "15:00 08.10.2025"],
        ["73:8A:1F:D5:49:BC", "Павлова Ольга Николаевна", "вход", "15:00 09.10.2025"],
        ["9C:2E:7B:46:F8:A3", "Федоров Игорь Александрович",
            "выход", "15:00 10.10.2025"],
        ["B5:4D:3A:81:EC:72", "Лебедева Татьяна Викторовна",
            "вход", "15:00 11.10.2025"],
        ["C8:7F:15:9A:63:D4", "Никитин Андрей Олегович", "выход", "15:00 12.10.2025"],
        ["E9:36:8C:2D:5A:B7", "Захарова Светлана Юрьевна", "вход", "15:00 13.10.2025"],
        ["1F:D4:72:BE:85:49", "Борисов Артем Михайлович", "выход", "15:00 14.10.2025"],
        ["52:AB:9E:34:C7:6D", "Киселева Надежда Павловна", "вход", "15:00 15.10.2025"],
        ["6C:19:4F:A8:D2:3B", "Григорьев Виктор Сергеевич",
            "выход", "15:00 16.10.2025"],
        ["87:E5:2D:7B:41:9C", "Титова Людмила Анатольевна",
            "вход", "15:00 17.10.2025"],
        ["A3:6D:58:CE:94:27", "Комарова Ирина Борисовна", "выход", "15:00 18.10.2025"],
        ["D1:4B:83:65:F2:9A", "Белов Роман Евгеньевич", "вход", "15:00 19.10.2025"],
        ["F4:28:9C:73:5D:B6", "Медведева Екатерина Андреевна",
            "выход", "15:00 20.10.2025"],
    ]

    for data in test_data:
        db.create(UserData(rfid=data[0], full_name=data[1], is_enter=data[2]
                           == "вход", date=datetime.datetime.strptime(data[3], "%H:%M %d.%m.%Y")))


add_test_data()


print(db.get(UserDataFilter(dateFrom=datetime.datetime.strptime("15:00 08.10.2025",
      "%H:%M %d.%m.%Y"), dateTo=datetime.datetime.strptime("15:00 10.10.2025", "%H:%M %d.%m.%Y"))))
